Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/pmu.h
/* -------- PMU_MODECTRL2 : (PMU Offset: 0x10) (R/W 32)  -------- */
#define PMU_MODECTRL2_RESETVALUE              _UINT32_(0x80000000)                                 /*  (PMU_MODECTRL2)   Reset Value */

#define PMU_MODECTRL2_VREG4CTRL_Pos           _UINT32_(0)                                          /* (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_VREG4CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL2_VREG4CTRL_Pos)      /* (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_VREG4CTRL(value)        (PMU_MODECTRL2_VREG4CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL2_VREG4CTRL_Pos)) /* Assignment of value for VREG4CTRL in the PMU_MODECTRL2 register */
#define PMU_MODECTRL2_VREG3CTRL_Pos           _UINT32_(8)                                          /* (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_VREG3CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL2_VREG3CTRL_Pos)      /* (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_VREG3CTRL(value)        (PMU_MODECTRL2_VREG3CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL2_VREG3CTRL_Pos)) /* Assignment of value for VREG3CTRL in the PMU_MODECTRL2 register */
#define PMU_MODECTRL2_VREG2CTRL_Pos           _UINT32_(16)                                         /* (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_VREG2CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL2_VREG2CTRL_Pos)      /* (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_VREG2CTRL(value)        (PMU_MODECTRL2_VREG2CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL2_VREG2CTRL_Pos)) /* Assignment of value for VREG2CTRL in the PMU_MODECTRL2 register */
#define PMU_MODECTRL2_VREG1CTRL_Pos           _UINT32_(24)                                         /* (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_VREG1CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL2_VREG1CTRL_Pos)      /* (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_VREG1CTRL(value)        (PMU_MODECTRL2_VREG1CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL2_VREG1CTRL_Pos)) /* Assignment of value for VREG1CTRL in the PMU_MODECTRL2 register */
#define PMU_MODECTRL2_BUCKMODE_Pos            _UINT32_(29)                                         /* (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_BUCKMODE_Msk            (_UINT32_(0x1) << PMU_MODECTRL2_BUCKMODE_Pos)        /* (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_BUCKMODE(value)         (PMU_MODECTRL2_BUCKMODE_Msk & (_UINT32_(value) << PMU_MODECTRL2_BUCKMODE_Pos)) /* Assignment of value for BUCKMODE in the PMU_MODECTRL2 register */
#define PMU_MODECTRL2_MLDOEN_Pos              _UINT32_(30)                                         /* (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_MLDOEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL2_MLDOEN_Pos)          /* (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_MLDOEN(value)           (PMU_MODECTRL2_MLDOEN_Msk & (_UINT32_(value) << PMU_MODECTRL2_MLDOEN_Pos)) /* Assignment of value for MLDOEN in the PMU_MODECTRL2 register */
#define PMU_MODECTRL2_BUCKEN_Pos              _UINT32_(31)                                         /* (PMU_MODECTRL2)  Position */
#define PMU_MODECTRL2_BUCKEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL2_BUCKEN_Pos)          /* (PMU_MODECTRL2)  Mask */
#define PMU_MODECTRL2_BUCKEN(value)           (PMU_MODECTRL2_BUCKEN_Msk & (_UINT32_(value) << PMU_MODECTRL2_BUCKEN_Pos)) /* Assignment of value for BUCKEN in the PMU_MODECTRL2 register */
#define PMU_MODECTRL2_Msk                     _UINT32_(0xFF1F1F1F)                                 /* (PMU_MODECTRL2) Register Mask  */


/* -------- PMU_MODECTRL3 : (PMU Offset: 0x14) (R/W 32)  -------- */
#define PMU_MODECTRL3_RESETVALUE              _UINT32_(0x80000000)                                 /*  (PMU_MODECTRL3)   Reset Value */

#define PMU_MODECTRL3_VREG4CTRL_Pos           _UINT32_(0)                                          /* (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_VREG4CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL3_VREG4CTRL_Pos)      /* (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_VREG4CTRL(value)        (PMU_MODECTRL3_VREG4CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL3_VREG4CTRL_Pos)) /* Assignment of value for VREG4CTRL in the PMU_MODECTRL3 register */
#define PMU_MODECTRL3_VREG3CTRL_Pos           _UINT32_(8)                                          /* (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_VREG3CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL3_VREG3CTRL_Pos)      /* (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_VREG3CTRL(value)        (PMU_MODECTRL3_VREG3CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL3_VREG3CTRL_Pos)) /* Assignment of value for VREG3CTRL in the PMU_MODECTRL3 register */
#define PMU_MODECTRL3_VREG2CTRL_Pos           _UINT32_(16)                                         /* (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_VREG2CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL3_VREG2CTRL_Pos)      /* (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_VREG2CTRL(value)        (PMU_MODECTRL3_VREG2CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL3_VREG2CTRL_Pos)) /* Assignment of value for VREG2CTRL in the PMU_MODECTRL3 register */
#define PMU_MODECTRL3_VREG1CTRL_Pos           _UINT32_(24)                                         /* (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_VREG1CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL3_VREG1CTRL_Pos)      /* (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_VREG1CTRL(value)        (PMU_MODECTRL3_VREG1CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL3_VREG1CTRL_Pos)) /* Assignment of value for VREG1CTRL in the PMU_MODECTRL3 register */
#define PMU_MODECTRL3_BUCKMODE_Pos            _UINT32_(29)                                         /* (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_BUCKMODE_Msk            (_UINT32_(0x1) << PMU_MODECTRL3_BUCKMODE_Pos)        /* (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_BUCKMODE(value)         (PMU_MODECTRL3_BUCKMODE_Msk & (_UINT32_(value) << PMU_MODECTRL3_BUCKMODE_Pos)) /* Assignment of value for BUCKMODE in the PMU_MODECTRL3 register */
#define PMU_MODECTRL3_MLDOEN_Pos              _UINT32_(30)                                         /* (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_MLDOEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL3_MLDOEN_Pos)          /* (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_MLDOEN(value)           (PMU_MODECTRL3_MLDOEN_Msk & (_UINT32_(value) << PMU_MODECTRL3_MLDOEN_Pos)) /* Assignment of value for MLDOEN in the PMU_MODECTRL3 register */
#define PMU_MODECTRL3_BUCKEN_Pos              _UINT32_(31)                                         /* (PMU_MODECTRL3)  Position */
#define PMU_MODECTRL3_BUCKEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL3_BUCKEN_Pos)          /* (PMU_MODECTRL3)  Mask */
#define PMU_MODECTRL3_BUCKEN(value)           (PMU_MODECTRL3_BUCKEN_Msk & (_UINT32_(value) << PMU_MODECTRL3_BUCKEN_Pos)) /* Assignment of value for BUCKEN in the PMU_MODECTRL3 register */
#define PMU_MODECTRL3_Msk                     _UINT32_(0xFF1F1F1F)                                 /* (PMU_MODECTRL3) Register Mask  */


/* -------- PMU_MODECTRL4 : (PMU Offset: 0x18) (R/W 32)  -------- */
#define PMU_MODECTRL4_RESETVALUE              _UINT32_(0x80000000)                                 /*  (PMU_MODECTRL4)   Reset Value */

