Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/pmu.h
#define PMU_MODECTRL4_VREG4CTRL_Pos           _UINT32_(0)                                          /* (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_VREG4CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL4_VREG4CTRL_Pos)      /* (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_VREG4CTRL(value)        (PMU_MODECTRL4_VREG4CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL4_VREG4CTRL_Pos)) /* Assignment of value for VREG4CTRL in the PMU_MODECTRL4 register */
#define PMU_MODECTRL4_VREG3CTRL_Pos           _UINT32_(8)                                          /* (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_VREG3CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL4_VREG3CTRL_Pos)      /* (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_VREG3CTRL(value)        (PMU_MODECTRL4_VREG3CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL4_VREG3CTRL_Pos)) /* Assignment of value for VREG3CTRL in the PMU_MODECTRL4 register */
#define PMU_MODECTRL4_VREG2CTRL_Pos           _UINT32_(16)                                         /* (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_VREG2CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL4_VREG2CTRL_Pos)      /* (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_VREG2CTRL(value)        (PMU_MODECTRL4_VREG2CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL4_VREG2CTRL_Pos)) /* Assignment of value for VREG2CTRL in the PMU_MODECTRL4 register */
#define PMU_MODECTRL4_VREG1CTRL_Pos           _UINT32_(24)                                         /* (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_VREG1CTRL_Msk           (_UINT32_(0x1F) << PMU_MODECTRL4_VREG1CTRL_Pos)      /* (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_VREG1CTRL(value)        (PMU_MODECTRL4_VREG1CTRL_Msk & (_UINT32_(value) << PMU_MODECTRL4_VREG1CTRL_Pos)) /* Assignment of value for VREG1CTRL in the PMU_MODECTRL4 register */
#define PMU_MODECTRL4_BUCKMODE_Pos            _UINT32_(29)                                         /* (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_BUCKMODE_Msk            (_UINT32_(0x1) << PMU_MODECTRL4_BUCKMODE_Pos)        /* (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_BUCKMODE(value)         (PMU_MODECTRL4_BUCKMODE_Msk & (_UINT32_(value) << PMU_MODECTRL4_BUCKMODE_Pos)) /* Assignment of value for BUCKMODE in the PMU_MODECTRL4 register */
#define PMU_MODECTRL4_MLDOEN_Pos              _UINT32_(30)                                         /* (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_MLDOEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL4_MLDOEN_Pos)          /* (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_MLDOEN(value)           (PMU_MODECTRL4_MLDOEN_Msk & (_UINT32_(value) << PMU_MODECTRL4_MLDOEN_Pos)) /* Assignment of value for MLDOEN in the PMU_MODECTRL4 register */
#define PMU_MODECTRL4_BUCKEN_Pos              _UINT32_(31)                                         /* (PMU_MODECTRL4)  Position */
#define PMU_MODECTRL4_BUCKEN_Msk              (_UINT32_(0x1) << PMU_MODECTRL4_BUCKEN_Pos)          /* (PMU_MODECTRL4)  Mask */
#define PMU_MODECTRL4_BUCKEN(value)           (PMU_MODECTRL4_BUCKEN_Msk & (_UINT32_(value) << PMU_MODECTRL4_BUCKEN_Pos)) /* Assignment of value for BUCKEN in the PMU_MODECTRL4 register */
#define PMU_MODECTRL4_Msk                     _UINT32_(0xFF1F1F1F)                                 /* (PMU_MODECTRL4) Register Mask  */


/* -------- PMU_OVERCTRL : (PMU Offset: 0x1C) (R/W 32)  -------- */
#define PMU_OVERCTRL_RESETVALUE               _UINT32_(0x80400000)                                 /*  (PMU_OVERCTRL)   Reset Value */

#define PMU_OVERCTRL_VREG4OCTRL_Pos           _UINT32_(0)                                          /* (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_VREG4OCTRL_Msk           (_UINT32_(0x1F) << PMU_OVERCTRL_VREG4OCTRL_Pos)      /* (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_VREG4OCTRL(value)        (PMU_OVERCTRL_VREG4OCTRL_Msk & (_UINT32_(value) << PMU_OVERCTRL_VREG4OCTRL_Pos)) /* Assignment of value for VREG4OCTRL in the PMU_OVERCTRL register */
#define PMU_OVERCTRL_VREG3OCTRL_Pos           _UINT32_(8)                                          /* (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_VREG3OCTRL_Msk           (_UINT32_(0x1F) << PMU_OVERCTRL_VREG3OCTRL_Pos)      /* (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_VREG3OCTRL(value)        (PMU_OVERCTRL_VREG3OCTRL_Msk & (_UINT32_(value) << PMU_OVERCTRL_VREG3OCTRL_Pos)) /* Assignment of value for VREG3OCTRL in the PMU_OVERCTRL register */
#define PMU_OVERCTRL_VREG2OCTRL_Pos           _UINT32_(16)                                         /* (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_VREG2OCTRL_Msk           (_UINT32_(0x1F) << PMU_OVERCTRL_VREG2OCTRL_Pos)      /* (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_VREG2OCTRL(value)        (PMU_OVERCTRL_VREG2OCTRL_Msk & (_UINT32_(value) << PMU_OVERCTRL_VREG2OCTRL_Pos)) /* Assignment of value for VREG2OCTRL in the PMU_OVERCTRL register */
#define PMU_OVERCTRL_PHWC_Pos                 _UINT32_(22)                                         /* (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_PHWC_Msk                 (_UINT32_(0x1) << PMU_OVERCTRL_PHWC_Pos)             /* (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_PHWC(value)              (PMU_OVERCTRL_PHWC_Msk & (_UINT32_(value) << PMU_OVERCTRL_PHWC_Pos)) /* Assignment of value for PHWC in the PMU_OVERCTRL register */
#define PMU_OVERCTRL_OVEREN_Pos               _UINT32_(23)                                         /* (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_OVEREN_Msk               (_UINT32_(0x1) << PMU_OVERCTRL_OVEREN_Pos)           /* (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_OVEREN(value)            (PMU_OVERCTRL_OVEREN_Msk & (_UINT32_(value) << PMU_OVERCTRL_OVEREN_Pos)) /* Assignment of value for OVEREN in the PMU_OVERCTRL register */
#define PMU_OVERCTRL_VREG1OCTRL_Pos           _UINT32_(24)                                         /* (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_VREG1OCTRL_Msk           (_UINT32_(0x1F) << PMU_OVERCTRL_VREG1OCTRL_Pos)      /* (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_VREG1OCTRL(value)        (PMU_OVERCTRL_VREG1OCTRL_Msk & (_UINT32_(value) << PMU_OVERCTRL_VREG1OCTRL_Pos)) /* Assignment of value for VREG1OCTRL in the PMU_OVERCTRL register */
#define PMU_OVERCTRL_OBUCKMODE_Pos            _UINT32_(29)                                         /* (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_OBUCKMODE_Msk            (_UINT32_(0x1) << PMU_OVERCTRL_OBUCKMODE_Pos)        /* (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_OBUCKMODE(value)         (PMU_OVERCTRL_OBUCKMODE_Msk & (_UINT32_(value) << PMU_OVERCTRL_OBUCKMODE_Pos)) /* Assignment of value for OBUCKMODE in the PMU_OVERCTRL register */
#define PMU_OVERCTRL_OMLDOEN_Pos              _UINT32_(30)                                         /* (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_OMLDOEN_Msk              (_UINT32_(0x1) << PMU_OVERCTRL_OMLDOEN_Pos)          /* (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_OMLDOEN(value)           (PMU_OVERCTRL_OMLDOEN_Msk & (_UINT32_(value) << PMU_OVERCTRL_OMLDOEN_Pos)) /* Assignment of value for OMLDOEN in the PMU_OVERCTRL register */
#define PMU_OVERCTRL_OBUCKEN_Pos              _UINT32_(31)                                         /* (PMU_OVERCTRL)  Position */
#define PMU_OVERCTRL_OBUCKEN_Msk              (_UINT32_(0x1) << PMU_OVERCTRL_OBUCKEN_Pos)          /* (PMU_OVERCTRL)  Mask */
#define PMU_OVERCTRL_OBUCKEN(value)           (PMU_OVERCTRL_OBUCKEN_Msk & (_UINT32_(value) << PMU_OVERCTRL_OBUCKEN_Pos)) /* Assignment of value for OBUCKEN in the PMU_OVERCTRL register */
#define PMU_OVERCTRL_Msk                      _UINT32_(0xFFDF1F1F)                                 /* (PMU_OVERCTRL) Register Mask  */


