Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/pmu.h
#define PMU_VBCRDATA_VBCRDATA_Pos             _UINT32_(0)                                          /* (PMU_VBCRDATA)  Position */
#define PMU_VBCRDATA_VBCRDATA_Msk             (_UINT32_(0xFFFFFFFF) << PMU_VBCRDATA_VBCRDATA_Pos)  /* (PMU_VBCRDATA)  Mask */
#define PMU_VBCRDATA_VBCRDATA(value)          (PMU_VBCRDATA_VBCRDATA_Msk & (_UINT32_(value) << PMU_VBCRDATA_VBCRDATA_Pos)) /* Assignment of value for VBCRDATA in the PMU_VBCRDATA register */
#define PMU_VBCRDATA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (PMU_VBCRDATA) Register Mask  */


/* -------- PMU_WCMCFG : (PMU Offset: 0x54) (R/W 32)  -------- */
#define PMU_WCMCFG_RESETVALUE                 _UINT32_(0x1100)                                     /*  (PMU_WCMCFG)   Reset Value */

#define PMU_WCMCFG_SRAM1_CFG_Pos              _UINT32_(8)                                          /* (PMU_WCMCFG)  Position */
#define PMU_WCMCFG_SRAM1_CFG_Msk              (_UINT32_(0x7) << PMU_WCMCFG_SRAM1_CFG_Pos)          /* (PMU_WCMCFG)  Mask */
#define PMU_WCMCFG_SRAM1_CFG(value)           (PMU_WCMCFG_SRAM1_CFG_Msk & (_UINT32_(value) << PMU_WCMCFG_SRAM1_CFG_Pos)) /* Assignment of value for SRAM1_CFG in the PMU_WCMCFG register */
#define PMU_WCMCFG_SRAM2_CFG_Pos              _UINT32_(12)                                         /* (PMU_WCMCFG)  Position */
#define PMU_WCMCFG_SRAM2_CFG_Msk              (_UINT32_(0x7) << PMU_WCMCFG_SRAM2_CFG_Pos)          /* (PMU_WCMCFG)  Mask */
#define PMU_WCMCFG_SRAM2_CFG(value)           (PMU_WCMCFG_SRAM2_CFG_Msk & (_UINT32_(value) << PMU_WCMCFG_SRAM2_CFG_Pos)) /* Assignment of value for SRAM2_CFG in the PMU_WCMCFG register */
#define PMU_WCMCFG_Msk                        _UINT32_(0x00007700)                                 /* (PMU_WCMCFG) Register Mask  */


/* -------- PMU_PMUIENB : (PMU Offset: 0x58) (R/W 32)  -------- */
#define PMU_PMUIENB_RESETVALUE                _UINT32_(0x00)                                       /*  (PMU_PMUIENB)   Reset Value */

#define PMU_PMUIENB_ADCBORIEN_Pos             _UINT32_(0)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_ADCBORIEN_Msk             (_UINT32_(0x1) << PMU_PMUIENB_ADCBORIEN_Pos)         /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_ADCBORIEN(value)          (PMU_PMUIENB_ADCBORIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_ADCBORIEN_Pos)) /* Assignment of value for ADCBORIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_BUCKBORIEN_Pos            _UINT32_(1)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_BUCKBORIEN_Msk            (_UINT32_(0x1) << PMU_PMUIENB_BUCKBORIEN_Pos)        /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_BUCKBORIEN(value)         (PMU_PMUIENB_BUCKBORIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_BUCKBORIEN_Pos)) /* Assignment of value for BUCKBORIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_SCMPIEN_Pos               _UINT32_(2)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_SCMPIEN_Msk               (_UINT32_(0x1) << PMU_PMUIENB_SCMPIEN_Pos)           /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_SCMPIEN(value)            (PMU_PMUIENB_SCMPIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_SCMPIEN_Pos)) /* Assignment of value for SCMPIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_WCMIAIEN_Pos              _UINT32_(3)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_WCMIAIEN_Msk              (_UINT32_(0x1) << PMU_PMUIENB_WCMIAIEN_Pos)          /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_WCMIAIEN(value)           (PMU_PMUIENB_WCMIAIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_WCMIAIEN_Pos)) /* Assignment of value for WCMIAIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_VBCIAIEN_Pos              _UINT32_(4)                                          /* (PMU_PMUIENB)  Position */
#define PMU_PMUIENB_VBCIAIEN_Msk              (_UINT32_(0x1) << PMU_PMUIENB_VBCIAIEN_Pos)          /* (PMU_PMUIENB)  Mask */
#define PMU_PMUIENB_VBCIAIEN(value)           (PMU_PMUIENB_VBCIAIEN_Msk & (_UINT32_(value) << PMU_PMUIENB_VBCIAIEN_Pos)) /* Assignment of value for VBCIAIEN in the PMU_PMUIENB register */
#define PMU_PMUIENB_Msk                       _UINT32_(0x0000001F)                                 /* (PMU_PMUIENB) Register Mask  */


/* -------- PMU_PMUISTAT : (PMU Offset: 0x5C) (R/W 32)  -------- */
#define PMU_PMUISTAT_RESETVALUE               _UINT32_(0x00)                                       /*  (PMU_PMUISTAT)   Reset Value */

#define PMU_PMUISTAT_ADCBORINT_Pos            _UINT32_(0)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_ADCBORINT_Msk            (_UINT32_(0x1) << PMU_PMUISTAT_ADCBORINT_Pos)        /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_ADCBORINT(value)         (PMU_PMUISTAT_ADCBORINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_ADCBORINT_Pos)) /* Assignment of value for ADCBORINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_BUCKBORINT_Pos           _UINT32_(1)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_BUCKBORINT_Msk           (_UINT32_(0x1) << PMU_PMUISTAT_BUCKBORINT_Pos)       /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_BUCKBORINT(value)        (PMU_PMUISTAT_BUCKBORINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_BUCKBORINT_Pos)) /* Assignment of value for BUCKBORINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_SCMPINT_Pos              _UINT32_(2)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_SCMPINT_Msk              (_UINT32_(0x1) << PMU_PMUISTAT_SCMPINT_Pos)          /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_SCMPINT(value)           (PMU_PMUISTAT_SCMPINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_SCMPINT_Pos)) /* Assignment of value for SCMPINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_WCMIAINT_Pos             _UINT32_(3)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_WCMIAINT_Msk             (_UINT32_(0x1) << PMU_PMUISTAT_WCMIAINT_Pos)         /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_WCMIAINT(value)          (PMU_PMUISTAT_WCMIAINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_WCMIAINT_Pos)) /* Assignment of value for WCMIAINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_VBCIAINT_Pos             _UINT32_(4)                                          /* (PMU_PMUISTAT)  Position */
#define PMU_PMUISTAT_VBCIAINT_Msk             (_UINT32_(0x1) << PMU_PMUISTAT_VBCIAINT_Pos)         /* (PMU_PMUISTAT)  Mask */
#define PMU_PMUISTAT_VBCIAINT(value)          (PMU_PMUISTAT_VBCIAINT_Msk & (_UINT32_(value) << PMU_PMUISTAT_VBCIAINT_Pos)) /* Assignment of value for VBCIAINT in the PMU_PMUISTAT register */
#define PMU_PMUISTAT_Msk                      _UINT32_(0x0000001F)                                 /* (PMU_PMUISTAT) Register Mask  */


/* -------- PMU_WCMSIZ : (PMU Offset: 0x60) (R/W 32)  -------- */
#define PMU_WCMSIZ_RESETVALUE                 _UINT32_(0x00)                                       /*  (PMU_WCMSIZ)   Reset Value */

